{
  "ref": "162132920",
  "price": "£75,000",
  "address": "Brougham Place, Hawick",
  "keyFeatures": [
    "2 DOUBLE BEDROOMS",
    "BATHROOM",
    "BEAUTIFUL PERIOD FEATURES",
    "CENTRAL LOCATION AND LOVELY VIEWS",
    "DINING KITCHEN",
    "EPC RATING D",
    "GAS CENTRAL HEATING",
    "HALLWAY",
    "SECURE ENTRY SYSTEM",
    "SITTING ROOM"
  ],
  "description": [
    "Bathroom 1.97 x 2.06",
    "Bedroom 2.05 x 3.29",
    "Brochure",
    "Brochures",
    "Brougham Place, Hawick",
    "Description not found",
    "Directions - The property is located just off the high street and is accessed via a secure entry door on Brougham Place. What3Words//",
    "Fixtures And Fittings - All floor coverings, light fittings and integrated appliances included in the sale.",
    "Heritage flat with original period features situated in the heart of the town overlooking the iconic Hawick horse monument. 1/4 Brougham Place exudes rustic charm and offers stunning features with stripped pine doors and skirtings. Located on the top floor this lovely 2 bedroom property benefits from stunning views over the town and countryside, secure entry system and gas central heating and would make an ideal first time buy, holiday home or rental investment.",
    "Kitchen/Dining Room 3.77 x 5.47",
    "Room Sizes - Hallway 4.67 x 2.00",
    "Sales And Other Information -",
    "Services - Mains drainage, water, gas and electricity.",
    "Single bedroom 2.00 x 2.78",
    "Sitting room 4.39 x 3.28",
    "The A7 provides a through-route to Edinburgh and south to Carlisle and the M6. Rail links are available at Berwick-Upon-Tweed, Carlisle, Tweedbank and Edinburgh. The nearest International Airports are located in Edinburgh and Newcastle.",
    "The Property - Entered at street level via a solid timber door with secure entry system, a very well maintained communal stair leads to the 3rd floor where the property is located and shares a landing with one other property. The hallway gives access to all accommodation and has a utility cupboard which houses the combination gas boiler and has space and plumbing for a washing machine. The sitting room is located to the side with 2 tall sash and case windows looking out to lovely views including Trinity Gardens and allowing good natural light to fill the room. The main focal point of the sitting room is the open grate fire with timber surround set on tile hearth. Also to the side is the single bedroom which enjoys the nice views and would make an ideal bedroom or working from home space. The main bedroom is to the rear with tall window and has hanging space for clothes. The dining kitchen is located at the end of the hallway with sash and case window and is a spacious room that could be used for everyday living purposes with ample space for furniture and a cosy log burning stove set on slate hearth. The kitchen is well equipped with base units and display cabinet, stainless steel worksurfaces and white tile to splashback areas. Quality integrated appliances including Smeg gas oven and hob with chimney style cooker hood over. Belfast sink with mixer tap and a Velux window flows light into the room. The bathroom comprises of beautiful freestanding roll top clawfoot bath with chrome taps and shower carefully chosen to tie in with the traditional style of the room, WC and wash hand basin. A Velux window allows good natural light in and a chrome heated towel rail is wall mounted. This stunning property has been lovingly maintained and is beaming with period features including stripped wood doors with brass handles, hard wood floors, high skirtings, traditional style radiators and dome dolly light switches. Decorated in neutral tones throughout and benefiting from gas central heating, this property is move in ready and should be viewed to fully appreciate the style and charm.",
    "The Town - Known for many years as The Queen of the Borders, and situated at the confluence of the Rivers Slitrig and Teviot, Hawick is the largest of the Border towns. Frequent winners of national floral awards, and famous world-wide for it's quality knitwear, Hawick is part of The Cashmere Trail and is the major centre for the industry in the Borders. There is a good range of shops, primary and secondary schooling. Hawick boasts the award winning Wilton Lodge Park which lies on the River Teviot, extending to some 107 acres, with many walks, recreational facilities, walled garden, Hawick Museum and Scott Gallery. The town is also famous for rugby, and has the benefit of a range of sporting and Leisure Centre facilities including many fine golf courses throughout the area. Many events are held in the town during the year, including the annual Common Riding.",
    "Travel - Selkirk 12 miles, Jedburgh 14 miles, Kelso 21 miles, Galashiels 18 miles, Melrose 19 miles, Newtown St Boswells 19 miles, Carlisle 44 miles, Edinburgh 55 miles, Newcastle 60 miles",
    "owadays.corn.hypnotist"
  ],
  "images": [
    "https://media.rightmove.co.uk/166k/165356/162132920/165356_33894397_FLP_00_0000.jpeg",
    "https://media.rightmove.co.uk/166k/165356/162132920/165356_33894397_FLP_01_0000.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_FLP_00_0000_max_296x197.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_FLP_01_0000_max_296x197.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_00_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_01_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_02_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_03_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_04_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165356/162132920/165356_33894397_IMG_05_0000_max_135x100.jpeg"
  ]
}