{
  "ref": "159430295",
  "price": "£105,000",
  "address": "49 High Street, Selkirk, TD7 4BZ",
  "keyFeatures": [
    "***13, Kirk Wynd, Selkirk, Selkirkshire TD7 4AW previously sold for £197,500, 109, High Street, Selkirk TD7 4JX sold for £215,000***",
    "Prime Property Auctions is excited to present this exceptional opportunity, this vacant 5 bedroom property located within a sought after location in Selkirk",
    "Property could achieve market rent of between £1000 - £1200 PCM / £12,000 - £14,400 PA which could give the property an impressive gross yield of 8% - 9.6% based on the guide",
    "Sure to appeal to shrewd buy to let investors looking for a great high yielding opportunity with great capital growth potential.",
    "The property is situated in a desirable area with great access to motorways, local amenities, restaurants, schools and sports facilities."
  ],
  "description": [
    "***13, Kirk Wynd, Selkirk, Selkirkshire TD7 4AW previously sold for £197,500, 109, High Street, Selkirk TD7 4JX sold for £215,000***",
    "Currently Vacant, Property could achieve market rent of between £1000 - £1200 PCM / £12,000 - £14,400 PA which could give the property an impressive gross yield of 10.8% - 11.5% based on the guide",
    "Entrance Hallway, Livingroom, 5 Spacious Bedrooms, Bathroom, Shower Room",
    "Location:",
    "Potentially excellent opportunity for serviced accommodation, with rates for 5 bed properties in the area starting from around £204 per night (subject to gaining necessary planning consents) At 70% occupancy per month, unit could achieve £4345 PCM (£52,122 P/A) which would generate an incredible 34.7% gross yield if secured at the guide.",
    "Prime Property Auctions is excited to present this exceptional opportunity, this vacant 5 bedroom property located within a sought after location in Selkirk",
    "Property Comprises:",
    "Property could achieve market rent of between £1000 - £1200 PCM / £12,000 - £14,400 PA which could give the property an impressive gross yield of 8% - 9.6% based on the guide",
    "Property is situated in a desirable area with great access to motorways, local amenities, restaurants, schools and sports facilities.",
    "Sales Evidence:",
    "Selkirk, one of the oldest Royal Burghs in Scotland, is a charming town in the heart of the Scottish Borders, rich in history, culture, and natural beauty. Perched above the scenic Ettrick Water, Selkirk is known for its strong textile heritage, historic connections to Sir Walter Scott, and its proud tradition of the annual Common Riding, one of Scotland's oldest equestrian festivals. The town's historic streets are lined with independent shops, cafes, and traditional pubs, creating a warm and welcoming atmosphere. Outdoor enthusiasts can explore the stunning landscapes of the Borders, with excellent walking, cycling, and fishing opportunities. With a strong community spirit, excellent local amenities, and easy access to nearby towns like Galashiels and Hawick, Selkirk offers the perfect blend of history, culture, and countryside living.",
    "Sure to appeal to shrewd buy to let investors looking for a great high yielding opportunity with great capital growth potential.",
    "The property is situated in a desirable area with great access to motorways, local amenities, restaurants, schools and sports facilities.",
    "The property will feature in our upcoming timed online auction. To participate in the live auction, you must have a bidding account created. For further details on how to have a bidding account created please contact the team.",
    "This lot is open to immediate offers. Should you wish to offer NOW, you can do so via our “Offer Now” button on our website.",
    "This property is offered at a fantastic price to ensure an Auction sale.",
    "and Kitchen, Garden . Property also benefits from gas central heating and ample storage throughout."
  ],
  "images": [
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_FLP_00_0001_max_296x197.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_00_0001_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_01_0001_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_02_0001_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_03_0001_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_04_0001_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/252k/251369/159430295/251369_215551087_IMG_05_0001_max_135x100.jpeg"
  ]
}