{
  "ref": "150131657",
  "price": "£250,000",
  "address": "Cross Keys Inn and Flat, Lilliesleaf, Melrose, TD6 9JA",
  "keyFeatures": [
    "Newly Renovated Three Bedroom Flat Above",
    "Public House and Restaurant",
    "Village Centre Location"
  ],
  "description": [
    "A wonderful opportunity to purchase a well-established and popular public house with restaurant and a newly refurbished self-contained three-bedroom flat situated in a picturesque village location, benefitting from a great deal of passing trade as well as a loyal customer base within the community.",
    "Bathroom: 2.50m x 1.90m",
    "Bedroom One: 4.50m x 3.30m",
    "Bedroom Three: 2.15m x 2.40m",
    "Bedroom Two: 4.30m x 3.20m",
    "Brochure 1",
    "Brochures",
    "EPC: Flat F   Bar G",
    "FLAT ROOM SIZES:",
    "Kitchen: 2.95m x 2.70m",
    "LOCATION: Lilliesleaf is an attractive village nestled in the midst of the Scottish Borders countryside, enjoying a wonderful sense of community with a village hall, pub, church and a golf course nearby. Located only a short drive from the beautiful town of Melrose with its specialist independent shops, resting on the banks of the River Tweed and well known for its historic Abbey, the Melrose Sevens and the Borders Book Festival. Further amenities can be found in nearby Selkirk and Galashiels, with Tweedbank providing a rail connection to Edinburgh. The surrounding countryside and rolling hills are popular with golfers, walkers, cyclists and equestrian enthusiasts and the village location will appeal to those with an interest in country pursuits looking for a peaceful quality of life.",
    "Lounge: 5.40m x 4.90m",
    "RATEABLE VALUE: £8400",
    "The Cross Keys Inn comprises bar with restaurant area and separate dining/seating area; full commercial kitchen; male & female toilets & beer garden to the front. A full list of fixtures & fittings can be obtained upon request.",
    "The Cross Keys Inn is a well-loved public house with restaurant in a fantastic village location. The business has operated as a popular country inn with a cosy and welcoming bar and restaurant, providing fantastic traditional food and drink with the benefit of a beer garden for customers to take full advantage of the beautiful setting whilst enjoying a drink.",
    "The newly refurbished first floor three-bedroom flat is very attractive, comprising lounge with dining area, newly fitted kitchen, bathroom and three bedrooms.  The property is well presented throughout and includes the following white goods - oven and hob.  There is space for a additional white goods. There is also a separate sizeable garden to the rear, which could lend itself to a further beer garden if so desired with raised decking areas and landscaping potential."
  ],
  "images": [
    "https://media.rightmove.co.uk/dir/166k/165542/150131657/165542_7756_IMG_01_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165542/150131657/165542_7756_IMG_02_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165542/150131657/165542_7756_IMG_03_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/166k/165542/150131657/165542_7756_IMG_11_0000_max_135x100.jpeg"
  ]
}