{
  "ref": "160647194",
  "price": "£105,000",
  "address": "10 Teviot Crescent, Hawick, TD9 9RE",
  "keyFeatures": [
    "Central Location",
    "Four/Five Bedroom Maisonette",
    "Large Cellar Rooms",
    "Lovely Outlook to the \"Wee Haugh\""
  ],
  "description": "This deceptively spacious and bright four/five bedroom maisonette is situated in a central location in the heart of town with a lovely bright outlook over the “Wee Haugh.”  Offered for sale in neat and tidy order, the property has scope for cosmetic modernisation allowing a prospective purchaser to make it their own.  Beneath the property is a large useful cellar offering fantastic storage space.\n\nThe property is entered via a shared close (one property on ground floor) The hallway has a staircase to the upper level and there is a useful understair storage cupboard.  On the lower level of the property there is a cloakroom, living room, office, lounge and kitchen.  The lounge and living room are both light and spacious and overlook the front of the property offering pleasant views and the main lounge has a wall mounted gas fire with fyffe stone fireplace.  The dining kitchen is situated to the rear and is a spacious room with floor and wall mounted units, space for a fridge freezer, cooker and washing machine.  There is also a one and a half bowl sink and drainer and the boiler is wall mounted in here.  The office is a useful additional room with a range of shelving which could be used for a variety of purposes and there is a two piece cloakroom comprising a WC and wash hand basin.\n\nSituated on the upper level are the three bedrooms, bathroom and extremely large walk in storage room (2.80 x 2.00).  Two of the bedrooms overlook the front and offer a lovely view and the third bedroom is to the other side.  All of the bedrooms have built in storage and carpet flooring.  The family bathroom is extremely spacious and houses a four piece suite of bath, shower enclosure, twin sinks and WC.\n\nExternally, the property has a shared courtyard to the rear with clothes drying facilities and there are two large cellar rooms beneath the property offering excellent storage space for bikes etc.\n\nTeviot Crescent is very conveniently placed for easy access to the town centre, Mart Street bus depot, several supermarkets and the Leisure Centre.  Hawick is a wonderful town steeped in a sense of history and tradition, set amidst the picturesque Scottish Borders countryside. Known as the ‘Home of Cashmere', the town offers a multitude of varied attractions, including the Borders Textile Towerhouse, Borders Distillery, cinema, Vertish Hill Golf Course and the award-winning Wilton Lodge Park and is famous for its proud rugby tradition. Hawick boasts a number of independent shops, public houses and bistros as well as larger supermarkets and is also the venue for the famous annual Common Riding and popular Summer Festival. The town also offers opportunities for walking, cycling, football, horse-riding, fishing and other country pursuits and the surrounding Border towns are easily accessible, as are Edinburgh, Newcastle and Carlisle. The Borders railway has stops at Galashiels and Tweedbank, both just a 25-minute drive away.\n\nROOM SIZES:\n\nLounge:  4.03 x 4.52\n\nKitchen: 4.15 x 3.43\n\nCloakroom:  3.39 x 1.27\n\nLiving Room/Bedroom:  3.88 x 3.40\n\nOffice/Bedroom:  3.00 x 2.42\n\nBedroom One: 3.23 x 4.08\n\nBedroom Two:  2.48 x 4.15\n\nBedroom Three:  3.64 x 3.03\n\nBathroom:  3.20 x 4.15\n\n \n\nBrochures\n\nBrochure 1",
  "images": {
    "https://media.rightmove.co.uk/166k/165542/160647194/165542_12892_IMG_00_0000.jpeg": "Can't convert image to text",
    "https://media.rightmove.co.uk/166k/165542/160647194/165542_12892_IMG_01_0000.jpeg": "Can't convert image to text",
    "https://media.rightmove.co.uk/166k/165542/160647194/165542_12892_IMG_02_0000.jpeg": "Can't convert image to text",
    "https://media.rightmove.co.uk/166k/165542/160647194/165542_12892_IMG_18_0000.jpeg": "Can't convert image to text"
  }
}