{
  "ref": "160697363",
  "price": "£35,000",
  "address": "The Lodge House, Bonjedward, Jedburgh, TD8 6UE",
  "keyFeatures": [
    "Category C Listed Property with Historical Interest",
    "It is anticipated that the property may not be suitable for standard lending purposes",
    "May be scope for a sympathetic extension - providing planning permissions are sought and granted",
    "Originally a one-bedroom, one-bathroom home, with no scope for further extension of the existing footprint.",
    "Presents a unique opportunity for a buyer with the expertise and resources to undertake such a project",
    "There are no existing utilities or parking facilities."
  ],
  "description": [
    "A public footpath and cycle path run to the front, side, and rear of the property, providing excellent access to surrounding walking and recreational routes. Waste and recycling bins for neighbouring estate properties remain located nearby; any changes to their placement are under review and may be subject to legal clarification.",
    "As full demolition and rebuilding are not permitted, the Lodge House must be retained and refurbished as a domestic dwelling or alternatively obtain relevant authority for any change of use. The existing structure, once comprising one bedroom and one bathroom, offers a unique chance for a buyer with the vision and resources to undertake a careful and sympathetic restoration. While the site has clear physical limitations, there may be modest scope for a well-designed, appropriately positioned extension, subject to the relevant planning and heritage approvals.",
    "Brochure",
    "Brochures",
    "Constructed in the early 19th century with later additions, The Lodge House is a Category C listed building of historical interest. Originally a one-bedroom detached bungalow, the property now presents a rare and exciting opportunity for restoration or development, providing relevant permissions are sought and granted. However, it is currently in a derelict and unsafe structural condition and will be sold strictly as seen, subject to specific conditions outlined by Scottish Borders Council Planning Department and Historic Environment Scotland (HES).",
    "Due to the unsafe nature of the structure, entry is at the buyer's own risk. Prospective purchasers should note that this is not a turnkey opportunity—it requires a significant investment of time, expertise, and resources to restore the property to a habitable condition. As such, it may be most suitable for individuals or organisations experienced in heritage conservation or sympathetic renovation projects.",
    "The property is not currently connected to any services, including gas, electricity, water, or drainage. Furthermore, there is no designated parking within the property's current boundary. Access from the main road is limited, and while there is currently no parking provision, any request for parking out with the immediate boundary may be considered, but would require approval from the relevant local and statutory authorities.",
    "Viewing and Lending Restrictions:",
    "Viewings are strictly by appointment with the Selling Agent. Please note from the outset that this property is subject to restricted viewing due to limitations concerning its mortgageability. It is anticipated that the property may not be suitable for standard lending purposes, and any interested parties are strongly advised to seek expert advice. The agent reserves the right to refuse viewings to anyone not in a proceedable position, given the safety concerns related to on-site visits. Additionally, unaccompanied site visits are prohibited and are at individuals own risk."
  ],
  "images": [
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_FLP_00_0000_max_296x197.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_00_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_01_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_02_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_03_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_04_0000_max_135x100.jpeg",
    "https://media.rightmove.co.uk/dir/176k/175910/160697363/175910_248705_IMG_10_0000_max_135x100.jpeg"
  ]
}